Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.121/PIC32CK-GC00/atdf/PIC32CK2051GC00100.atdf
<?xml version="1.0"?>
<!--
 Copyright (c) 2021 Microchip Technology Inc.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<!--
CHPMKR VERSION: 2.5.0
-->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="4.5" public="true" xsi:noNamespaceSchemaLocation="https://schemas.microchip.com/com/microchip/atdf/4.5/atdf.xsd">
  <file timestamp="2023-02-20T18:47:35Z"/>
  <variants xmlns:mhc="http://www.atmel.com/schemas/avr-tools-device-file/mhc">
    <variant ordercode="PIC32CK2051GC00100-I/DD" mhc:ordercode="PIC32CK2051GC00100-I/DD" package="TQFP100" pinout="P100" speedmax="120000000" tempmin="-40" tempmax="85" vccmin="1.71" vccmax="3.60"/>
    <variant ordercode="PIC32CK2051GC00100-E/DD" mhc:ordercode="PIC32CK2051GC00100-E/DD" package="TQFP100" pinout="P100" speedmax="120000000" tempmin="-40" tempmax="125" vccmin="1.71" vccmax="3.60"/>
  </variants>
  <devices>
    <device name="PIC32CK2051GC00100" architecture="CORTEX-M33" family="PIC32CK" series="PIC32CKGC00">
      <address-spaces>
        <address-space id="base" name="base" start="0" size="0x100000000" endianness="little">
          <memory-segment name="CMCC_DATARAM" start="0x0" size="0x1000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="CMCC_TAGRAM" start="0x1000" size="0x400" type="ram" rw="RW"/>
          <memory-segment name="CMCC_VALIDRAM" start="0x3000" size="0x40" type="ram" rw="RW"/>
          <memory-segment name="PRM_ROM" start="0x4000000" size="0x8000" type="rom" rw="R" exec="true"/>
          <memory-segment name="FLASH_BFM" start="0x8000000" size="0x20000" type="flash" pagesize="4096" rw="RW" exec="true"/>
          <memory-segment name="FLASH_CFM_USERCFG1" start="0xA000000" size="0x1000" type="flash" pagesize="4096" rw="RW"/>
          <memory-segment name="FLASH_CFM_USEROTP1" start="0xA001000" size="0x1000" type="user_signatures" pagesize="4096" rw="RW"/>
          <memory-segment name="FLASH_CFM_BOOTCFG1" start="0xA002000" size="0x1000" type="flash" pagesize="4096" rw="RW"/>
          <memory-segment name="FLASH_CFM_DALCFG" start="0xA004000" size="0x1000" type="flash" pagesize="4096" rw="RW"/>
          <memory-segment name="FLASH_CFM_CALBACKUP" start="0xA006000" size="0x1000" type="flash" pagesize="4096" rw="RW"/>
          <memory-segment name="FLASH_CFM_CALOTP" start="0xA007000" size="0x1000" type="other" pagesize="4096" rw="R"/>
          <memory-segment name="FLASH_CFM_USERCFG2" start="0xA008000" size="0x1000" type="flash" pagesize="4096" rw="RW"/>
          <memory-segment name="FLASH_CFM_USEROTP2" start="0xA009000" size="0x1000" type="user_signatures" pagesize="4096" rw="RW"/>
          <memory-segment name="FLASH_CFM_BOOTCFG2" start="0xA00A000" size="0x1000" type="flash" pagesize="4096" rw="RW"/>
          <memory-segment name="FLASH_PFM" start="0xC000000" size="0x200000" type="flash" pagesize="4096" rw="RW" exec="true"/>
          <memory-segment name="SQI_SFR" start="0xFFFF000" size="0x1000" type="io" rw="RW"/>
          <memory-segment name="SQI_XIP" start="0x10000000" size="0x10000000" type="ram" rw="RW" exec="true" external="true"/>
          <memory-segment name="HSRAM_RET" start="0x20000000" size="0x80000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="HPB0_BRIDGE" start="0x44000000" size="0x30000" type="io" rw="RW"/>
          <memory-segment name="HPB1_BRIDGE" start="0x44800000" size="0x30000" type="io" rw="RW"/>
          <memory-segment name="HPB2_BRIDGE" start="0x45000000" size="0x30000" type="io" rw="RW"/>
          <memory-segment name="USBHS_SFR" start="0x46000000" size="0x1600" type="io" rw="RW"/>
          <memory-segment name="EBI_CS0" start="0x60000000" size="0x1000000" type="ram" rw="RW" exec="true" external="true"/>
          <memory-segment name="EBI_CS1" start="0x61000000" size="0x1000000" type="ram" rw="RW" exec="true" external="true"/>
          <memory-segment name="EBI_CS2" start="0x62000000" size="0x1000000" type="ram" rw="RW" exec="true" external="true"/>
          <memory-segment name="EBI_CS3" start="0x63000000" size="0x1000000" type="ram" rw="RW" exec="true" external="true"/>
          <memory-segment name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW"/>
        </address-space>
      </address-spaces>
      <parameters>
        <param name="GCLK_ID_TRACE" value="47" caption="Index of Generic Clock"/>
        <param name="LITTLE_ENDIAN" value="1" caption="Little Endian"/>
        <param name="NUM_IRQ" value="158" caption="Number of Interrupt Requests"/>
        <param name="__BKPT_NUM" value="8" caption="Number of FPB breakpoint comparators"/>
        <param name="__CM33_REV" value="0x0000" caption="Cortex-M33 Revision"/>
        <param name="__DEBUG_LVL" value="2" caption="Debug Level"/>
        <param name="__DSP_PRESENT" value="1" caption="DSP extension present or not"/>
        <param name="__ETM_PRESENT" value="1" caption="ETM present or not"/>
        <param name="__FPU_PRESENT" value="1" caption="FPU present or not"/>
        <param name="__ITM_PRESENT" value="1" caption="ITM present or not"/>
        <param name="__MPU_PRESENT" value="1" caption="MPU present or not"/>
        <param name="__MPU_REGIONS" value="8" caption="Number of MPU regions"/>
        <param name="__MTB_PRESENT" value="0" caption="MTB present or not"/>
        <param name="__NVIC_PRIO_BITS" value="3" caption="Number of NVIC Priority bits"/>
        <param name="__SAU_PRESENT" value="0" caption="SAU present or not"/>
        <param name="__SEC_ENABLED" value="0" caption="TrustZone-M enabled or not"/>
        <param name="__SYST_NUM" value="2" caption="Number of SysTick instances"/>
        <param name="__TRACE_LVL" value="2" caption="Trace Level"/>
        <param name="__VTOR_PRESENT" value="1" caption="Vector Table Offset Register present or not"/>
        <param name="__Vendor_SysTickConfig" value="0" caption="Set to 1 if different SysTick Config is used"/>
        <param name="__WPT_NUM" value="4" caption="Number of DWT watchpoint comparators"/>
        <param name="POWER_DOMAIN" value="PD_CORE_SW"/>
        <param name="__ARCH_ARM" value="1"/>
        <param name="__ARCH_ARM_CORTEX_M" value="1"/>
      </parameters>
      <peripherals>
        <module name="AC" id="03784" name2="cmp_ac_u2501_v2" version="2a0">
          <instance name="AC">
            <register-group name="AC" name-in-module="AC" address-space="base" offset="0x45012000"/>
            <signals>
              <signal group="AIN" index="0" function="B" pad="PA06"/>
              <signal group="AIN" index="1" function="B" pad="PA07"/>
              <signal group="AIN" index="2" function="B" pad="PC06"/>
              <signal group="AIN" index="3" function="B" pad="PC07"/>
              <signal group="CMP" index="0" function="M" pad="PA11" ioset="3"/>
              <signal group="CMP" index="0" function="M" pad="PC09" ioset="1"/>
              <signal group="CMP" index="1" function="M" pad="PA12" ioset="3"/>
              <signal group="CMP" index="1" function="M" pad="PC15" ioset="1"/>
            </signals>
            <parameters>
              <param name="ATEST_IMPLEMENTED" value="1" caption="Defines if the ATEST register is implemented"/>
              <param name="ATEST_SIZE" value="2" caption="Defines the number of effective bits in ATEST register"/>
              <param name="DACVALUE_BIT" value="7" caption="Defines the number of bits in DACCTRLn.VALUE"/>
              <param name="GCLK_ID" value="34" caption="Index of Generic Clock"/>
              <param name="IO_INPUTS" value="4" caption="Defines the number of AC pair inputs connected to IO pins"/>
              <param name="PAIRS" value="1" caption="Defines the number of AC pairs"/>
              <param name="INSTANCE_ID" value="73" caption="Instance index for AC"/>
              <param name="MCLK_ID_APB" value="105" caption="Index for AC APB clock"/>
              <param name="PAC_ID" value="73" caption="Index for AC registers write protection"/>
              <param name="NUM_CMP" value="2" caption="Number of comparators"/>
              <param name="LOAD_CALIB" value="0" caption="Defines if calibration is required"/>
            </parameters>
          </instance>
        </module>
        <module name="ADC" id="03620" name2="adc_msh_ctrl_apb_v1" version="1b0">
          <instance name="ADC">
            <register-group name="ADC" name-in-module="ADC" address-space="base" offset="0x45010000"/>
            <signals>
              <signal group="VINM" index="0" function="B" pad="PA05"/>
              <signal group="VINM" index="2" function="B" pad="PA07"/>
              <signal group="VINM" index="4" function="B" pad="PA18"/>
              <signal group="VINP" index="0" function="B" pad="PA04"/>
              <signal group="VINP" index="1" function="B" pad="PA05"/>
              <signal group="VINP" index="2" function="B" pad="PA06"/>
              <signal group="VINP" index="3" function="B" pad="PA07"/>
              <signal group="VINP" index="4" function="B" pad="PA08"/>
              <signal group="VINP" index="5" function="B" pad="PA09"/>
              <signal group="VINP" index="6" function="B" pad="PA10"/>
              <signal group="VINP" index="7" function="B" pad="PA11"/>
              <signal group="VINP" index="8" function="B" pad="PA12"/>
              <signal group="VINP" index="9" function="B" pad="PB00"/>
              <signal group="VINP" index="10" function="B" pad="PB11"/>
              <signal group="VINP" index="11" function="B" pad="PB12"/>
              <signal group="VREFP" index="0" function="B" pad="PB01"/>
            </signals>
            <parameters>
              <param name="APB_FIFO_DEPTH" value="16" caption="Number of Words in APB FIFO"/>
              <param name="CHNSAR_NMBR1" value="15" caption="Number of Channels on SARCORE number 1"/>
              <param name="CHNSAR_NMBR2" value="0" caption="Number of Channels on SARCORE number 2"/>
              <param name="CHNSAR_NMBR3" value="0" caption="Number of Channels on SARCORE number 3"/>
              <param name="CHNSAR_NMBR4" value="0" caption="Number of Channels on SARCORE number 4"/>
              <param name="DCMP_NMBR" value="1" caption="Number of Digital Comparators Max=4"/>
              <param name="DMAC_ID_PFFRDY" value="61"/>
              <param name="EARLY_INTR_PRESENT" value="1" caption="Early Interrupts Present"/>
              <param name="FLTR_NMBR" value="1" caption="Number of Digital Filters, Max=0"/>
              <param name="GCLK_ID" value="33" caption="Index of Generic Clock"/>
              <param name="OCP_ADDR_WIDTH" value="0" caption="OCP Address Width"/>
              <param name="OCP_FIFO_DEPTH" value="0" caption="Number of Words in OCP DMA FIFO"/>
              <param name="OCP_PORT_PRESENT" value="0" caption="OCP DMA Bus Master Present"/>
              <param name="SARCORE_NMBR" value="1" caption="Number of SARCOREs. Max=4, Min-1"/>
              <param name="TRGS_NMBR" value="16" caption="Number of Trigger Sources, Max=16"/>
              <param name="VREF_STARTUP_TIME" value="50" caption="Number of Control Clock cycles for VREF to stabalize"/>
              <param name="INSTANCE_ID" value="72" caption="Instance index for ADC"/>
              <param name="MCLK_ID_APB" value="104" caption="Index for ADC APB clock"/>
              <param name="PAC_ID" value="72" caption="Index for ADC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="CCL" id="03718" name2="cla_ccl_u2225_v2" version="2b0">
          <instance name="CCL">
            <register-group name="CCL" name-in-module="CCL" address-space="base" offset="0x4501A000"/>
            <signals>
              <signal group="IN" index="0" function="M" pad="PB07" ioset="1"/>
              <signal group="IN" index="1" function="M" pad="PB08" ioset="1"/>
              <signal group="IN" index="2" function="M" pad="PB09" ioset="1"/>
              <signal group="IN" index="3" function="M" pad="PC10" ioset="1"/>
              <signal group="IN" index="4" function="M" pad="PC11" ioset="1"/>
              <signal group="IN" index="5" function="M" pad="PC12" ioset="1"/>
              <signal group="IN" index="6" function="M" pad="PD08" ioset="1"/>
              <signal group="IN" index="7" function="M" pad="PD09" ioset="1"/>
              <signal group="IN" index="8" function="M" pad="PD10" ioset="1"/>
              <signal group="IN" index="9" function="M" pad="PA04" ioset="1"/>
              <signal group="IN" index="9" function="M" pad="PA13" ioset="2"/>
              <signal group="IN" index="10" function="M" pad="PA05" ioset="1"/>
              <signal group="IN" index="10" function="M" pad="PA14" ioset="2"/>
              <signal group="IN" index="11" function="M" pad="PA06" ioset="1"/>
              <signal group="IN" index="11" function="M" pad="PA15" ioset="2"/>
              <signal group="OUT" index="0" function="M" pad="PB10" ioset="1"/>
              <signal group="OUT" index="1" function="M" pad="PC13" ioset="1"/>
              <signal group="OUT" index="2" function="M" pad="PD11" ioset="1"/>
              <signal group="OUT" index="3" function="M" pad="PA07" ioset="1"/>
              <signal group="OUT" index="3" function="M" pad="PA16" ioset="2"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="37" caption="GCLK index for CCL"/>
              <param name="LUT_NUM" value="4" caption="Number of LUT in a CCL"/>
              <param name="INSTANCE_ID" value="77" caption="Instance index for CCL"/>
              <param name="MCLK_ID_APB" value="109" caption="Index for CCL APB clock"/>
              <param name="PAC_ID" value="77" caption="Index for CCL registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="CMCC" id="03708" name2="drm_cmcc_v6" version="6e1">
          <instance name="CMCC">
            <register-group name="CMCC" name-in-module="CMCC" address-space="base" offset="0x44808000"/>
            <parameters>
              <param name="INSTANCE_ID" value="36" caption="Instance index for CMCC"/>
              <param name="MCLK_ID_AHB" value="11" caption="Index for CMCC AHB clock"/>
              <param name="PAC_ID" value="36" caption="Index for CMCC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="CoreDebug" id="SYSTEM_IP" version="1.0.0">
          <instance name="CoreDebug">
            <register-group name="CoreDebug" name-in-module="CoreDebug" address-space="base" offset="0xE000EDF0"/>
