Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.121/PIC32CK-GC00/atdf/PIC32CK2051GC00100.atdf
        <register name="CIDR0" offset="0xFF0" rw="R" size="4" access-size="4" initval="0x0000000D" caption="DWT Component Identification Register 0">
          <bitfield name="PRMBL_0" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
        <register name="CIDR1" offset="0xFF4" rw="R" size="4" access-size="4" initval="0x00000090" caption="DWT Component Identification Register 1">
          <bitfield name="PRMBL_1" caption="CoreSight component identification preamble" mask="0xF"/>
          <bitfield name="CLASS" caption="CoreSight component class" mask="0xF0"/>
        </register>
        <register name="CIDR2" offset="0xFF8" rw="R" size="4" access-size="4" initval="0x00000005" caption="DWT Component Identification Register 2">
          <bitfield name="PRMBL_2" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
        <register name="CIDR3" offset="0xFFC" rw="R" size="4" access-size="4" initval="0x000000B1" caption="DWT Component Identification Register 3">
          <bitfield name="PRMBL_3" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="LAR__KEY">
        <value name="UNLOCK" caption="Unlock key value" value="0xC5ACCE55"/>
      </value-group>
    </module>
    <module name="EBI" id="03591" name2="emb_hsmc3_v1" version="1a0" caption="External Bus Interface">
      <register-group name="CS_X" size="0x10">
        <register name="SMC_SETUP" offset="0x0" rw="RW" size="4" access-size="4" initval="0x01010101" caption="SMC Setup Register">
          <bitfield name="NWE_SETUP" caption="NWE Setup Length" mask="0x3F"/>
          <bitfield name="NCS_WR_SETUP" caption="NCS Setup Length in WRITE Access" mask="0x3F00"/>
          <bitfield name="NRD_SETUP" caption="NRD Setup Length" mask="0x3F0000"/>
          <bitfield name="NCS_RD_SETUP" caption="NCS Setup Length in READ Access" mask="0x3F000000"/>
        </register>
        <register name="SMC_PULSE" offset="0x4" rw="RW" size="4" access-size="4" initval="0x01010101" caption="SMC Pulse Register">
          <bitfield name="NWE_PULSE" caption="NWE Pulse Length" mask="0x7F"/>
          <bitfield name="NCS_WR_PULSE" caption="NCS Pulse Length in WRITE Access" mask="0x7F00"/>
          <bitfield name="NRD_PULSE" caption="NRD Pulse Length" mask="0x7F0000"/>
          <bitfield name="NCS_RD_PULSE" caption="NCS Pulse Length in READ Access" mask="0x7F000000"/>
        </register>
        <register name="SMC_CYCLE" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00030003" caption="SMC Cycle Register">
          <bitfield name="NWE_CYCLE" caption="Total Write Cycle Length" mask="0x1FF"/>
          <bitfield name="NRD_CYCLE" caption="Total Read Cycle Length" mask="0x1FF0000"/>
        </register>
        <register name="SMC_MODE" offset="0xC" rw="RW" size="4" access-size="4" initval="0x10001003" caption="SMC Mode Register">
          <bitfield name="READ_MODE" caption="Read Mode" mask="0x1"/>
          <bitfield name="WRITE_MODE" caption="Write Mode" mask="0x2"/>
          <bitfield name="EXNW_MODE" caption="NWAIT Mode" mask="0x30" values="SMC_MODE__EXNW_MODE"/>
          <bitfield name="BAT" caption="Byte Access Type" mask="0x100" values="SMC_MODE__BAT"/>
          <bitfield name="DBW" caption="Data Bus Width" mask="0x1000" values="SMC_MODE__DBW"/>
          <bitfield name="TDF_CYCLES" caption="Data Float Time" mask="0xF0000"/>
          <bitfield name="TDF_MODE" caption="TDF Optimization" mask="0x100000"/>
          <bitfield name="PMEN" caption="Page Mode Enabled" mask="0x1000000"/>
          <bitfield name="PS" caption="Page Size" mask="0x30000000" values="SMC_MODE__PS"/>
        </register>
      </register-group>
      <register-group name="EBI" caption="External Bus Interface">
        <register-group name="CS_X" name-in-module="CS_X" offset="0x00" size="0x10" count="4"/>
        <register name="SMC_WPMR" offset="0xE4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="SMC Write Protection Mode Register">
          <bitfield name="WPEN" caption="Write Protect Enable" mask="0x1"/>
          <bitfield name="WPKEY" caption="Write Protection Key" mask="0xFFFFFF00" values="SMC_WPMR__WPKEY"/>
        </register>
        <register name="SMC_WPSR" offset="0xE8" rw="R" size="4" access-size="4" initval="0x00000000" caption="SMC Write Protection Status Register">
          <bitfield name="WPVS" caption="Write Protection Violation Status" mask="0x1"/>
          <bitfield name="WPVSRC" caption="Write Protection Violation Source" mask="0xFFFF00"/>
        </register>
      </register-group>
      <value-group caption="" name="SMC_MODE__EXNW_MODE">
        <value caption="Disabled-The NWAIT input signal is ignored on the corresponding chip select." name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped." name="FROZEN" value="0x2"/>
        <value caption="Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high." name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE__BAT">
        <value caption="Byte select access type:- Write operation is controlled using NCS, NWE, NBS0, NBS1.- Read operation is controlled using NCS, NRD, NBS0, NBS1." name="BYTE_SELECT" value="0"/>
        <value caption="Byte write access type:- Write operation is controlled using NCS, NWR0, NWR1.- Read operation is controlled using NCS and NRD." name="BYTE_WRITE" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE__DBW">
        <value caption="8-bit Data Bus" name="_8_BIT" value="0"/>
        <value caption="16-bit Data Bus" name="_16_BIT" value="1"/>
      </value-group>
