Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.121/PIC32CK-GC00/atdf/PIC32CK2051GC00100.atdf
        <register name="PMUX" offset="0x30" rw="RW" size="1" count="16" initval="0x00" caption="Peripheral Multiplexing">
          <bitfield name="PMUXE" caption="Peripheral Multiplexing for Even-Numbered Pin" mask="0xF" values="PORT_PMUX__PMUXE"/>
          <bitfield name="PMUXO" caption="Peripheral Multiplexing for Odd-Numbered Pin" mask="0xF0" values="PORT_PMUX__PMUXO"/>
        </register>
        <register name="PINCFG" offset="0x40" rw="RW" size="1" count="32" initval="0x00" caption="Pin Configuration">
          <bitfield name="PMUXEN" caption="Peripheral Multiplexer Enable" mask="0x1"/>
          <bitfield name="INEN" caption="Input Enable" mask="0x2"/>
          <bitfield name="PULLEN" caption="Pull Enable" mask="0x4"/>
          <bitfield name="ODRAIN" caption="Open Drain Output" mask="0x8"/>
          <bitfield name="SLEWLIM" caption="Output Driver Slew Rate Selection" mask="0x30" values="PINCFG__SLEWLIM"/>
        </register>
      </register-group>
      <register-group name="PORT" caption="Port Module">
        <register-group name="GROUP" name-in-module="GROUP" offset="0x00" size="0x80" count="4"/>
      </register-group>
      <value-group name="PORT_EVCTRL__EVACT0">
        <value name="OUT" caption="Event output to pin" value="0x0"/>
        <value name="SET" caption="Set output register of pin on event" value="0x1"/>
        <value name="CLR" caption="Clear output register of pin on event" value="0x2"/>
        <value name="TGL" caption="Toggle output register of pin on event" value="0x3"/>
      </value-group>
      <value-group name="PORT_PMUX__PMUXE">
        <value name="A" caption="Peripheral function A selected" value="0x0"/>
        <value name="B" caption="Peripheral function B selected" value="0x1"/>
        <value name="C" caption="Peripheral function C selected" value="0x2"/>
        <value name="D" caption="Peripheral function D selected" value="0x3"/>
        <value name="E" caption="Peripheral function E selected" value="0x4"/>
        <value name="F" caption="Peripheral function F selected" value="0x5"/>
        <value name="G" caption="Peripheral function G selected" value="0x6"/>
        <value name="H" caption="Peripheral function H selected" value="0x7"/>
        <value name="I" caption="Peripheral function I selected" value="0x8"/>
        <value name="J" caption="Peripheral function J selected" value="0x9"/>
        <value name="K" caption="Peripheral function K selected" value="0xA"/>
        <value name="L" caption="Peripheral function L selected" value="0xB"/>
        <value name="M" caption="Peripheral function M selected" value="0xC"/>
        <value name="P" caption="Peripheral function P selected" value="0xF"/>
      </value-group>
      <value-group name="PORT_PMUX__PMUXO">
        <value name="A" caption="Peripheral function A selected" value="0x0"/>
        <value name="B" caption="Peripheral function B selected" value="0x1"/>
        <value name="C" caption="Peripheral function C selected" value="0x2"/>
        <value name="D" caption="Peripheral function D selected" value="0x3"/>
        <value name="E" caption="Peripheral function E selected" value="0x4"/>
        <value name="F" caption="Peripheral function F selected" value="0x5"/>
        <value name="G" caption="Peripheral function G selected" value="0x6"/>
        <value name="H" caption="Peripheral function H selected" value="0x7"/>
        <value name="I" caption="Peripheral function I selected" value="0x8"/>
        <value name="J" caption="Peripheral function J selected" value="0x9"/>
        <value name="K" caption="Peripheral function K selected" value="0xA"/>
        <value name="L" caption="Peripheral function L selected" value="0xB"/>
        <value name="M" caption="Peripheral function M selected" value="0xC"/>
        <value name="P" caption="Peripheral function P selected" value="0xF"/>
      </value-group>
      <value-group name="PINCFG__SLEWLIM">
        <value name="FAST" caption="Slew rate control disabled (fast rise/fall time operation)" value="0x0"/>
        <value name="SLOW4" caption="Slew rate control enabled (4x slower)" value="0x1"/>
        <value name="SLOW8" caption="Slew rate control enabled (8x slower)" value="0x2"/>
        <value name="SLOW12" caption="Slew rate control enabled (12x slower)" value="0x3"/>
      </value-group>
    </module>
    <module name="PRM" id="03575" name2="prm_boot_ahb_v1" version="1a0" caption="Boot ROM Controller">
      <register-group name="PRM" caption="Boot ROM Controller">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000002" caption="CONTROL A REGISTER">
          <bitfield name="SWRST" caption="SOFTWARE RESET BIT" mask="0x1"/>
          <bitfield name="ENABLE" caption="ENABLE BIT" mask="0x2"/>
          <bitfield name="PRMWS" caption="ROM ACCESS TIME WAIT STATE" mask="0x700"/>
        </register>
      </register-group>
    </module>
    <module name="PTC" id="03721" name2="afe_ptc_ctrl_u2215_v6" version="6a0" caption="Peripheral Touch Controller">
      <register-group name="PTC" caption="Peripheral Touch Controller"/>
    </module>
    <module name="RSTC" id="03926" name2="pwr_rpmu_rstc_v1" version="1b0" caption="Reset Controller">
      <register-group name="RSTC" caption="Reset Controller">
        <register name="RCAUSE" offset="0x0" rw="R" size="2" caption="Reset Cause">
          <bitfield name="POR" caption="Power On Reset" mask="0x1"/>
          <bitfield name="PORCORE" caption="Brown Out CORE Detector Reset" mask="0x2"/>
          <bitfield name="BORVDDREG" caption="Brown Out VDDREG Detector Reset" mask="0x4"/>
          <bitfield name="BORVDDA" caption="Brown Out VDDA Detector Reset" mask="0x8"/>
          <bitfield name="BORVDDIO" caption="Brown Out VDDIO Detector Reset" mask="0x10"/>
          <bitfield name="EXT" caption="External Reset" mask="0x20"/>
          <bitfield name="WDT" caption="Watchdog Reset" mask="0x40"/>
          <bitfield name="SYST" caption="System Reset Request" mask="0x80"/>
          <bitfield name="BACKUP" caption="Backup Reset" mask="0x100"/>
          <bitfield name="LOCKUP" caption="Lockup Reset" mask="0x200"/>
        </register>
        <register name="BKUPEXIT" offset="0x2" rw="R" size="1" initval="0x00" caption="Backup Exit Source. Implemented only if RSTC_BACKUP_IMPLEMENTED=1">
          <bitfield name="VBAT0" caption="VBAT failure in backup mode" mask="0x1"/>
          <bitfield name="RTC" caption="Real Timer Counter Interrupt" mask="0x2"/>
          <bitfield name="BBPS0" caption="Battery Backup Power Switch" mask="0x4"/>
          <bitfield name="HIB0" caption="Hibernate" mask="0x80"/>
        </register>
        <register name="DBGCTRL" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Debug Control">
          <bitfield name="LCKUPDIS" caption="Lockup Disable" mask="0x1"/>
        </register>
      </register-group>
    </module>
    <module name="RTC" id="03608" name2="tmr_rtc_u2250_v3" version="3b0" caption="Real-Time Counter">
      <register-group name="MODE2_ALARM" size="0x8">
        <mode name="MODE2" qualifier="RTC.MODE2.CTRLA.MODE" value="2" caption="Clock/Calendar with Alarm"/>
        <register modes="MODE2" name="ALARM" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="MODE2_ALARM Alarm n Value">
          <bitfield name="SECOND" caption="Second" mask="0x3F"/>
          <bitfield name="MINUTE" caption="Minute" mask="0xFC0"/>
          <bitfield name="HOUR" caption="Hour" mask="0x1F000" values="MODE2_ALARM__HOUR"/>
          <bitfield name="DAY" caption="Day" mask="0x3E0000"/>
          <bitfield name="MONTH" caption="Month" mask="0x3C00000"/>
          <bitfield name="YEAR" caption="Year" mask="0xFC000000"/>
        </register>
        <register modes="MODE2" name="MASK" offset="0x4" rw="RW" access="WSYNC" size="1" initval="0x00" caption="MODE2_ALARM Alarm n Mask">
          <bitfield name="SEL" caption="Alarm Mask Selection" mask="0x7" values="MODE2_MASK__SEL"/>
        </register>
      </register-group>
      <register-group name="RTC" caption="Real-Time Counter">
        <mode name="MODE0" qualifier="RTC.MODE0.CTRLA.MODE" value="0" caption="32-bit Counter with Single 32-bit Compare"/>
        <mode name="MODE1" qualifier="RTC.MODE1.CTRLA.MODE" value="1" caption="16-bit Counter with Two 16-bit Compares"/>
        <mode name="MODE2" qualifier="RTC.MODE2.CTRLA.MODE" value="2" caption="Clock/Calendar with Alarm"/>
        <register modes="MODE0" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="MODE0 Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0xC" values="MODE0_CTRLA__MODE"/>
          <bitfield name="MATCHCLR" caption="Clear on Match" mask="0x80"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0xF00" values="RTC_MODE0_CTRLA__PRESCALER"/>
          <bitfield name="GPTRST" caption="GP Registers Reset On Tamper Enable" mask="0x4000"/>
          <bitfield name="COUNTSYNC" caption="Count Read Synchronization Enable" mask="0x8000"/>
        </register>
        <register modes="MODE1" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="MODE1 Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0xC" values="MODE1_CTRLA__MODE"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0xF00" values="RTC_MODE1_CTRLA__PRESCALER"/>
          <bitfield name="GPTRST" caption="GP Registers Reset On Tamper Enable" mask="0x4000"/>
          <bitfield name="COUNTSYNC" caption="Count Read Synchronization Enable" mask="0x8000"/>
        </register>
        <register modes="MODE2" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="MODE2 Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0xC" values="MODE2_CTRLA__MODE"/>
          <bitfield name="CLKREP" caption="Clock Representation" mask="0x40"/>
          <bitfield name="MATCHCLR" caption="Clear on Match" mask="0x80"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0xF00" values="RTC_MODE2_CTRLA__PRESCALER"/>
          <bitfield name="GPTRST" caption="GP Registers Reset On Tamper Enable" mask="0x4000"/>
          <bitfield name="CLOCKSYNC" caption="Clock Read Synchronization Enable" mask="0x8000"/>
        </register>
