Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.121/PIC32CK-GC00/atdf/PIC32CK2051GC00100.atdf
        <register name="EISTR" offset="0x32" rw="RW" size="2" access-size="2" initval="0x0000" caption="Error Interrupt Status">
          <mode name="DEFAULT" caption="SD_SDIO"/>
          <mode name="EMMC"/>
          <bitfield name="CMDTEO" caption="Command Timeout Error" mask="0x1" values="EISTR__CMDTEO"/>
          <bitfield name="CMDCRC" caption="Command CRC Error" mask="0x2" values="EISTR__CMDCRC"/>
          <bitfield name="CMDEND" caption="Command End Bit Error" mask="0x4" values="EISTR__CMDEND"/>
          <bitfield name="CMDIDX" caption="Command Index Error" mask="0x8" values="EISTR__CMDIDX"/>
          <bitfield name="DATTEO" caption="Data Timeout Error" mask="0x10" values="EISTR__DATTEO"/>
          <bitfield name="DATCRC" caption="Data CRC Error" mask="0x20" values="EISTR__DATCRC"/>
          <bitfield name="DATEND" caption="Data End Bit Error" mask="0x40" values="EISTR__DATEND"/>
          <bitfield name="CURLIM" caption="Current Limit Error" mask="0x80" values="EISTR__CURLIM"/>
          <bitfield name="ACMD" caption="Auto CMD Error" mask="0x100" values="EISTR__ACMD"/>
          <bitfield name="ADMA" caption="ADMA Error" mask="0x200" values="EISTR__ADMA"/>
          <bitfield modes="EMMC" name="BOOTAE" caption="Boot Acknowledge Error" mask="0x1000" values="EISTR__BOOTAE"/>
        </register>
        <register name="NISTER" offset="0x34" rw="RW" size="2" access-size="2" initval="0x0000" caption="Normal Interrupt Status Enable">
          <mode name="DEFAULT" caption="SD_SDIO"/>
          <mode name="EMMC"/>
          <bitfield name="CMDC" caption="Command Complete Status Enable" mask="0x1" values="NISTER__CMDC"/>
          <bitfield name="TRFC" caption="Transfer Complete Status Enable" mask="0x2" values="NISTER__TRFC"/>
          <bitfield name="BLKGE" caption="Block Gap Event Status Enable" mask="0x4" values="NISTER__BLKGE"/>
          <bitfield name="DMAINT" caption="DMA Interrupt Status Enable" mask="0x8" values="NISTER__DMAINT"/>
          <bitfield name="BWRRDY" caption="Buffer Write Ready Status Enable" mask="0x10" values="NISTER__BWRRDY"/>
          <bitfield name="BRDRDY" caption="Buffer Read Ready Status Enable" mask="0x20" values="NISTER__BRDRDY"/>
          <bitfield modes="DEFAULT" name="CINS" caption="Card Insertion Status Enable" mask="0x40" values="NISTER__CINS"/>
          <bitfield modes="DEFAULT" name="CREM" caption="Card Removal Status Enable" mask="0x80" values="NISTER__CREM"/>
          <bitfield modes="DEFAULT" name="CINT" caption="Card Interrupt Status Enable" mask="0x100" values="NISTER__CINT"/>
          <bitfield modes="EMMC" name="BOOTAR" caption="Boot Acknowledge Received Status Enable" mask="0x4000"/>
        </register>
        <register name="EISTER" offset="0x36" rw="RW" size="2" access-size="2" initval="0x0000" caption="Error Interrupt Status Enable">
          <mode name="DEFAULT" caption="SD_SDIO"/>
          <mode name="EMMC"/>
          <bitfield name="CMDTEO" caption="Command Timeout Error Status Enable" mask="0x1" values="EISTER__CMDTEO"/>
          <bitfield name="CMDCRC" caption="Command CRC Error Status Enable" mask="0x2" values="EISTER__CMDCRC"/>
          <bitfield name="CMDEND" caption="Command End Bit Error Status Enable" mask="0x4" values="EISTER__CMDEND"/>
          <bitfield name="CMDIDX" caption="Command Index Error Status Enable" mask="0x8" values="EISTER__CMDIDX"/>
          <bitfield name="DATTEO" caption="Data Timeout Error Status Enable" mask="0x10" values="EISTER__DATTEO"/>
          <bitfield name="DATCRC" caption="Data CRC Error Status Enable" mask="0x20" values="EISTER__DATCRC"/>
          <bitfield name="DATEND" caption="Data End Bit Error Status Enable" mask="0x40" values="EISTER__DATEND"/>
          <bitfield name="CURLIM" caption="Current Limit Error Status Enable" mask="0x80" values="EISTER__CURLIM"/>
          <bitfield name="ACMD" caption="Auto CMD Error Status Enable" mask="0x100" values="EISTER__ACMD"/>
          <bitfield name="ADMA" caption="ADMA Error Status Enable" mask="0x200" values="EISTER__ADMA"/>
          <bitfield modes="EMMC" name="BOOTAE" caption="Boot Acknowledge Error Status Enable" mask="0x1000"/>
        </register>
        <register name="NISIER" offset="0x38" rw="RW" size="2" access-size="2" initval="0x0000" caption="Normal Interrupt Signal Enable">
          <mode name="DEFAULT" caption="SD_SDIO"/>
          <mode name="EMMC"/>
          <bitfield name="CMDC" caption="Command Complete Signal Enable" mask="0x1" values="NISIER__CMDC"/>
          <bitfield name="TRFC" caption="Transfer Complete Signal Enable" mask="0x2" values="NISIER__TRFC"/>
          <bitfield name="BLKGE" caption="Block Gap Event Signal Enable" mask="0x4" values="NISIER__BLKGE"/>
          <bitfield name="DMAINT" caption="DMA Interrupt Signal Enable" mask="0x8" values="NISIER__DMAINT"/>
          <bitfield name="BWRRDY" caption="Buffer Write Ready Signal Enable" mask="0x10" values="NISIER__BWRRDY"/>
          <bitfield name="BRDRDY" caption="Buffer Read Ready Signal Enable" mask="0x20" values="NISIER__BRDRDY"/>
          <bitfield modes="DEFAULT" name="CINS" caption="Card Insertion Signal Enable" mask="0x40" values="NISIER__CINS"/>
          <bitfield modes="DEFAULT" name="CREM" caption="Card Removal Signal Enable" mask="0x80" values="NISIER__CREM"/>
          <bitfield modes="DEFAULT" name="CINT" caption="Card Interrupt Signal Enable" mask="0x100" values="NISIER__CINT"/>
          <bitfield modes="EMMC" name="BOOTAR" caption="Boot Acknowledge Received Signal Enable" mask="0x4000"/>
        </register>
        <register name="EISIER" offset="0x3A" rw="RW" size="2" access-size="2" initval="0x0000" caption="Error Interrupt Signal Enable">
          <mode name="DEFAULT" caption="SD_SDIO"/>
          <mode name="EMMC"/>
          <bitfield name="CMDTEO" caption="Command Timeout Error Signal Enable" mask="0x1" values="EISIER__CMDTEO"/>
          <bitfield name="CMDCRC" caption="Command CRC Error Signal Enable" mask="0x2" values="EISIER__CMDCRC"/>
          <bitfield name="CMDEND" caption="Command End Bit Error Signal Enable" mask="0x4" values="EISIER__CMDEND"/>
          <bitfield name="CMDIDX" caption="Command Index Error Signal Enable" mask="0x8" values="EISIER__CMDIDX"/>
          <bitfield name="DATTEO" caption="Data Timeout Error Signal Enable" mask="0x10" values="EISIER__DATTEO"/>
          <bitfield name="DATCRC" caption="Data CRC Error Signal Enable" mask="0x20" values="EISIER__DATCRC"/>
          <bitfield name="DATEND" caption="Data End Bit Error Signal Enable" mask="0x40" values="EISIER__DATEND"/>
          <bitfield name="CURLIM" caption="Current Limit Error Signal Enable" mask="0x80" values="EISIER__CURLIM"/>
          <bitfield name="ACMD" caption="Auto CMD Error Signal Enable" mask="0x100" values="EISIER__ACMD"/>
          <bitfield name="ADMA" caption="ADMA Error Signal Enable" mask="0x200" values="EISIER__ADMA"/>
          <bitfield modes="EMMC" name="BOOTAE" caption="Boot Acknowledge Error Signal Enable" mask="0x1000"/>
        </register>
        <register name="ACESR" offset="0x3C" rw="R" size="2" access-size="2" initval="0x0000" caption="Auto CMD Error Status">
          <bitfield name="ACMD12NE" caption="Auto CMD12 Not Executed" mask="0x1" values="ACESR__ACMD12NE"/>
          <bitfield name="ACMDTEO" caption="Auto CMD Timeout Error" mask="0x2" values="ACESR__ACMDTEO"/>
          <bitfield name="ACMDCRC" caption="Auto CMD CRC Error" mask="0x4" values="ACESR__ACMDCRC"/>
          <bitfield name="ACMDEND" caption="Auto CMD End Bit Error" mask="0x8" values="ACESR__ACMDEND"/>
          <bitfield name="ACMDIDX" caption="Auto CMD Index Error" mask="0x10" values="ACESR__ACMDIDX"/>
          <bitfield name="CMDNI" caption="Command not Issued By Auto CMD12 Error" mask="0x80" values="ACESR__CMDNI"/>
        </register>
        <register name="HC2R" offset="0x3E" rw="RW" size="2" access-size="2" initval="0x0000" caption="Host Control 2">
          <mode name="DEFAULT" caption="SD_SDIO"/>
          <mode name="EMMC"/>
          <bitfield modes="DEFAULT" name="UHSMS" caption="UHS Mode Select" mask="0x7" values="HC2R__UHSMS"/>
          <bitfield modes="DEFAULT" name="VS18EN" caption="1.8V Signaling Enable" mask="0x8" values="HC2R__VS18EN"/>
          <bitfield modes="EMMC" name="HS200EN" caption="HS200 Mode Enable" mask="0xF" values="HC2R__HS200EN"/>
          <bitfield name="DRVSEL" caption="Driver Strength Select" mask="0x30" values="HC2R__DRVSEL"/>
          <bitfield name="EXTUN" caption="Execute Tuning" mask="0x40" values="HC2R__EXTUN"/>
          <bitfield name="SLCKSEL" caption="Sampling Clock Select" mask="0x80" values="HC2R__SLCKSEL"/>
          <bitfield modes="DEFAULT" name="ASINTEN" caption="Asynchronous Interrupt Enable" mask="0x4000" values="HC2R__ASINTEN"/>
          <bitfield name="PVALEN" caption="Preset Value Enable" mask="0x8000" values="HC2R__PVALEN"/>
        </register>
        <register name="CA0R" offset="0x40" rw="RW" size="4" access-size="4" initval="0x27E8008C" caption="Capabilities 0">
          <bitfield name="TEOCLKF" caption="Timeout Clock Frequency" mask="0x3F" values="CA0R__TEOCLKF"/>
          <bitfield name="TEOCLKU" caption="Timeout Clock Unit" mask="0x80" values="CA0R__TEOCLKU"/>
          <bitfield name="BASECLKF" caption="Base Clock Frequency" mask="0xFF00" values="CA0R__BASECLKF"/>
          <bitfield name="MAXBLKL" caption="Max Block Length" mask="0x30000" values="CA0R__MAXBLKL"/>
          <bitfield name="ED8SUP" caption="8-bit Support for Embedded Device" mask="0x40000" values="CA0R__ED8SUP"/>
          <bitfield name="ADMA2SUP" caption="ADMA2 Support" mask="0x80000" values="CA0R__ADMA2SUP"/>
          <bitfield name="HSSUP" caption="High Speed Support" mask="0x200000" values="CA0R__HSSUP"/>
          <bitfield name="SDMASUP" caption="SDMA Support" mask="0x400000" values="CA0R__SDMASUP"/>
          <bitfield name="SRSUP" caption="Suspend/Resume Support" mask="0x800000" values="CA0R__SRSUP"/>
          <bitfield name="V33VSUP" caption="Voltage Support 3.3V" mask="0x1000000" values="CA0R__V33VSUP"/>
          <bitfield name="V30VSUP" caption="Voltage Support 3.0V" mask="0x2000000" values="CA0R__V30VSUP"/>
          <bitfield name="V18VSUP" caption="Voltage Support 1.8V" mask="0x4000000" values="CA0R__V18VSUP"/>
          <bitfield name="SB64SUP" caption="64-Bit System Bus Support" mask="0x10000000" values="CA0R__SB64SUP"/>
          <bitfield name="ASINTSUP" caption="Asynchronous Interrupt Support" mask="0x20000000" values="CA0R__ASINTSUP"/>
          <bitfield name="SLTYPE" caption="Slot Type" mask="0xC0000000" values="CA0R__SLTYPE"/>
        </register>
